app/Controllers/Frontend/Home.php

    public function index()
    {

        $data = $this->getCommonData();
        $data['mainSlider'] = $this->sliderModel->getAllSlider();
        $data['officers'] = $this->officerModel->getAllOfficer();
        $data['intro'] = $this->introductionModel->singleData($id = 1);
        $data['get_tab'] = $this->tabModel->getAllTabsList();
        $data['get_post_list_of_tab'] = $this->postModel->getAllpostListFortab();
        $data['navList'] = $this->navigationModel->getAllTab();
        $data['galleryList'] = $this->galleryModel->getAllpost();
        $data['popuplist'] = $this->popupModel->getPopup(); // this is
        $data['visitor'] = $this->visitcounterModel->getAllVisitor();
        $data['video'] = $this->videoModel->getLastVideo();
        $data['relatedLinks'] = $this->relatedlinkModel->orderBy('orderBY','Asc')->findAll();
        $data['location'] = $this->locationModel->where('id','1')->first();
---
SELECT *
FROM `locations`
WHERE `id` = '1'
 LIMIT 1